[
  {
    "id": 1,
    "name": "Archery",
    "description": "Archery involves using a bow to shoot arrows at a target.",
    "types": [
      "Target archery (distance shooting at stationary targets)",
      "Field archery (shooting at various targets in outdoor settings)"
    ]
  },
  {
    "id": 2,
    "name": "Badminton",
    "description": "A racquet sport played with a shuttlecock (birdie) over a net.",
    "types": ["Singles (one player per side)", "Doubles (two players per side)"]
  },
  {
    "id": 3,
    "name": "Basketball",
    "description": "A team sport played on a rectangular court, aiming to score points by shooting a ball through a hoop.",
    "types": [
      "Regular basketball",
      "3x3 basketball (played with 3 players per team on a half-court)"
    ]
  },
  {
    "id": 4,
    "name": "Boxing",
    "description": "A combat sport where two participants throw punches at each other within a boxing ring.",
    "types": [
      "Amateur boxing (Olympics)",
      "Professional boxing (various sanctioning bodies)"
    ]
  },
  {
    "id": 5,
    "name": "Cycling BMX Freestyle",
    "description": "Freestyle BMX involves performing tricks and stunts on specially designed BMX bikes.",
    "types": ["Park", "Street", "Dirt", "Vert"]
  },
  {
    "id": 6,
    "name": "Cycling Track",
    "description": "Track cycling involves racing on a banked oval track, typically indoors.",
    "types": ["Sprint", "Team pursuit", "Keirin", "Omnium"]
  },
  {
    "id": 7,
    "name": "Fencing",
    "description": "Fencing is a combat sport where participants use bladed weapons to score points on their opponent.",
    "types": ["Foil", "Épée", "Sabre"]
  },
  {
    "id": 8,
    "name": "Judo",
    "description": "Judo is a martial arts and combat sport focusing on throws and grappling techniques.",
    "types": [
      "Matches are won by ippon (full point)",
      "Waza-ari (half point)",
      "Penalties (Shido)"
    ]
  },
  {
    "id": 9,
    "name": "Karate",
    "description": "Karate is a martial art involving striking, kicking, knee and elbow strikes, and open-handed techniques.",
    "types": [
      "Various styles exist, including Shotokan, Wado-ryu, and Goju-ryu."
    ]
  },
  {
    "id": 10,
    "name": "Sailing",
    "description": "Sailing involves using wind to propel a boat across water.",
    "types": [
      "Different classes of boats exist, such as dinghies, keelboats, and multihulls",
      "Racing formats include fleet racing and match racing"
    ]
  },
  {
    "id": 11,
    "name": "Shooting",
    "description": "Shooting sports involve using firearms or air guns to hit targets.",
    "types": [
      "Rifle shooting",
      "Pistol shooting",
      "Shotgun shooting (trap, skeet)",
      "Precision shooting"
    ]
  },
  {
    "id": 12,
    "name": "Tennis",
    "description": "Tennis is a racket sport played individually (singles) or in pairs (doubles), hitting a ball over a net.",
    "types": [
      "Court types include grass, clay, and hard courts",
      "Matches won by games and sets"
    ]
  },
  {
    "id": 13,
    "name": "Wrestling",
    "description": "Wrestling is a combat sport involving grappling techniques such as throws and pins.",
    "types": [
      "Freestyle wrestling (common in the Olympics, allowing holds above and below the waist)",
      "Greco-Roman wrestling (restricts holds to above the waist)"
    ]
  }
]
